app/controllers/api/version1/abduct_controller.rb

            def show
                @survivor = Survivor.find(params[:id])
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

            def update

                @possible_abducted_survivor = Survivor.find(params[:id])

                not_abducted_survivors_list = Array.new
                for survivor in Survivor.all
                    if survivor.abducted == "no"
                        not_abducted_survivors_list.append survivor.name
                    end
                end

                @possible_abducted_survivor.update_attribute(:last_survivor_name_abduct_report, @possible_abducted_survivor.last_survivor_name_abduct_report)
                @survivor_name_report = @possible_abducted_survivor.last_survivor_name_abduct_report

                if @possible_abducted_survivor.update_attributes(survivor_report_abduction_name_params)
                    if not_abducted_survivors_list.include? @survivor_name_report
                        @abduct_score = @possible_abducted_survivor.abduct_score
                        @abduct_score += 1
                        @possible_abducted_survivor.update_attribute(:abduct_score, "#{@abduct_score}")
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "survivors".* FROM "survivors"
UPDATE "survivors" SET "last_survivor_name_abduct_report" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["last_survivor_name_abduct_report", "Test"], ["updated_at", "2019-05-05 03:37:26.305885"], ["id", 2]]
UPDATE "survivors" SET "last_survivor_name_abduct_report" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["last_survivor_name_abduct_report", "Ervin Metz"], ["updated_at", "2019-05-05 03:50:30.175874"], ["id", 100]]
UPDATE "survivors" SET "updated_at" = ?, "abduct_score" = ? WHERE "survivors"."id" = ?  [["updated_at", "2019-05-05 03:50:41.022232"], ["abduct_score", 2], ["id", 100]]