app/controllers/api/version1/reports_controller.rb

SELECT COUNT(*) FROM "survivors" WHERE "survivors"."abducted" = ?  [["abducted", "yes"]]
SELECT COUNT(*) FROM "survivors" WHERE "survivors"."abducted" = ?  [["abducted", "no"]]
SELECT COUNT(*) FROM "survivors"
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            def index
                @abducted_survivors_percent = Survivor.where(abducted: "t").count/Survivor.count.to_f*100
                @non_abducted_survivors_percent = Survivor.where(abducted: "f").count/Survivor.count.to_f*100
                @survivors_ordered_by_name_with_abducted_status = Hash.new
                for i in 1..Survivor.count
                    @survivors_ordered_by_name_with_abducted_status[Survivor.find(i).name] = Survivor.find(i).abducted