app/controllers/api/version1/reports_controller.rb

            def index
                @abducted_survivors_percent = Survivor.where(abducted: "yes").count/Survivor.count.to_f*100
                @non_abducted_survivors_percent = Survivor.where(abducted: "no").count/Survivor.count.to_f*100
                @survivors_ordered_by_name_with_abducted_status = Hash.new
                @ids_list = Array.new

                for survivor in Survivor.all
---
SELECT "survivors".* FROM "survivors"