app/controllers/api/version1/survivors_controller.rb

SELECT "survivors".* FROM "survivors" ORDER BY name ASC
---
            def index
                @survivors = Survivor.order('name ASC')

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
            def show
                @survivor = Survivor.find(params[:id])

INSERT INTO "survivors" ("name", "age", "gender", "latitude", "longitude", "abducted", "created_at", "updated_at", "abduct_score", "last_survivor_name_abduct_report") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
            def create
                @survivor = Survivor.new(survivor_params)

                if @survivor.save

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
UPDATE "survivors" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["latitude", 80.004125012], ["longitude", -50.04102410245], ["updated_at", "2019-05-05 03:56:13.801728"], ["id", 50]]
---
            def update
                @survivor = Survivor.find(params[:id])
                if @survivor.update_attributes(last_location_params)